---
kind: property
id: P:Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.EnableIgnoredCategoryIds
source: html/c146653a-ed81-ee52-7102-a6c2ad8a4d7c.htm
---
# Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.EnableIgnoredCategoryIds Property

When this setting is true, elements with category ids returned by
 GetIgnoredCategoryIds will be ignored in route calculation.
 default is true as all elements with the Door Category Id are ignored by default.

## Syntax (C#)
```csharp
public bool EnableIgnoredCategoryIds { get; set; }
```